# GetAttribute Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCAnyHandle..::..GetAttribute Method
IFCAnyHandle Class See Also
---
Gets the attribute by name.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IFCData GetAttribute(
	string name
)
```

Visual Basic
---
```text
Public Function GetAttribute ( _
	name As String _
) As IFCData
```

Visual C++
---
```text
public:
IFCData^ GetAttribute(
	String^ name
)
```

# ### Parameters
name
    Type: System..::..String The name.
# ### Return Value
The value.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
IFCAnyHandle Class
Autodesk.Revit.DB.IFC Namespace